{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>+\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "name": "lambda_1", "output_shape_type": "raw", "function_type": "lambda", "output_shape": null, "trainable": true, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activation": "linear", "dim_ordering": "tf", "nb_filter": 24, "border_mode": "valid", "W_constraint": null, "init": "he_normal", "subsample": [2, 2], "nb_row": 5, "b_constraint": null, "name": "convolution2d_1", "trainable": true, "bias": true, "W_regularizer": null, "activity_regularizer": null, "nb_col": 5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activation": "linear", "dim_ordering": "tf", "nb_filter": 36, "border_mode": "valid", "W_constraint": null, "init": "he_normal", "subsample": [2, 2], "nb_row": 5, "b_constraint": null, "name": "convolution2d_2", "trainable": true, "bias": true, "W_regularizer": null, "activity_regularizer": null, "nb_col": 5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activation": "linear", "dim_ordering": "tf", "nb_filter": 48, "border_mode": "valid", "W_constraint": null, "init": "he_normal", "subsample": [2, 2], "nb_row": 5, "b_constraint": null, "name": "convolution2d_3", "trainable": true, "bias": true, "W_regularizer": null, "activity_regularizer": null, "nb_col": 5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activation": "linear", "dim_ordering": "tf", "nb_filter": 64, "border_mode": "valid", "W_constraint": null, "init": "he_normal", "subsample": [1, 1], "nb_row": 3, "b_constraint": null, "name": "convolution2d_4", "trainable": true, "bias": true, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activation": "linear", "dim_ordering": "tf", "nb_filter": 64, "border_mode": "valid", "W_constraint": null, "init": "he_normal", "subsample": [1, 1], "nb_row": 3, "b_constraint": null, "name": "convolution2d_5", "trainable": true, "bias": true, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 1164, "activation": "linear", "W_regularizer": null, "W_constraint": null, "init": "he_normal", "b_constraint": null, "name": "dense_1", "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 100, "activation": "linear", "W_regularizer": null, "W_constraint": null, "init": "he_normal", "b_constraint": null, "name": "dense_2", "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 100, "activation": "linear", "W_regularizer": null, "W_constraint": null, "init": "he_normal", "b_constraint": null, "name": "dense_3", "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.4, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 10, "activation": "linear", "W_regularizer": null, "W_constraint": null, "init": "he_normal", "b_constraint": null, "name": "dense_4", "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 1, "activation": "linear", "W_regularizer": null, "W_constraint": null, "init": "he_normal", "b_constraint": null, "name": "dense_5", "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null}}]}