{"keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>+\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "input_dtype": "float32", "output_shape_type": "raw", "function_type": "lambda", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "nb_filter": 24, "bias": true, "W_regularizer": null, "init": "he_normal", "nb_col": 5, "nb_row": 5, "b_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "name": "convolution2d_1", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "nb_filter": 36, "bias": true, "W_regularizer": null, "init": "he_normal", "nb_col": 5, "nb_row": 5, "b_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "name": "convolution2d_2", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "nb_filter": 48, "bias": true, "W_regularizer": null, "init": "he_normal", "nb_col": 5, "nb_row": 5, "b_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "name": "convolution2d_3", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "nb_filter": 64, "bias": true, "W_regularizer": null, "init": "he_normal", "nb_col": 3, "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "name": "convolution2d_4", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "nb_filter": 64, "bias": true, "W_regularizer": null, "init": "he_normal", "nb_col": 3, "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "name": "convolution2d_5", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "bias": true, "init": "he_normal", "output_dim": 1164, "activity_regularizer": null, "b_constraint": null, "name": "dense_1", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "bias": true, "init": "he_normal", "output_dim": 100, "activity_regularizer": null, "b_constraint": null, "name": "dense_2", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "bias": true, "init": "he_normal", "output_dim": 100, "activity_regularizer": null, "b_constraint": null, "name": "dense_3", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.4}}, {"class_name": "Dense", "config": {"input_dim": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "bias": true, "init": "he_normal", "output_dim": 10, "activity_regularizer": null, "b_constraint": null, "name": "dense_4", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_9", "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "bias": true, "init": "he_normal", "output_dim": 1, "activity_regularizer": null, "b_constraint": null, "name": "dense_5", "activation": "linear"}}], "class_name": "Sequential"}