{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [null, 160, 320, 3], "nb_row": 3, "bias": true, "nb_filter": 32, "W_regularizer": null, "W_constraint": null, "subsample": [1, 1], "input_dtype": "float32", "dim_ordering": "tf", "name": "convolution2d_1", "nb_col": 3, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "valid", "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "bias": true, "nb_filter": 32, "W_regularizer": null, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "name": "convolution2d_2", "nb_col": 3, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "bias": true, "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "name": "convolution2d_3", "nb_col": 3, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "valid", "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "bias": true, "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "name": "convolution2d_4", "nb_col": 3, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "input_dim": 189696, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "name": "dense_1", "output_dim": 512, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "input_dim": 512, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "name": "dense_2", "output_dim": 1, "activation": "linear"}}]}