{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "input_dtype": "float32", "W_constraint": null, "W_regularizer": null, "nb_col": 3, "batch_input_shape": [null, 160, 320, 3], "b_regularizer": null, "bias": true, "name": "convolution2d_1", "nb_row": 3, "nb_filter": 32, "trainable": true, "dim_ordering": "tf", "border_mode": "same", "b_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "nb_filter": 32, "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "nb_row": 3, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "nb_filter": 64, "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "border_mode": "same", "name": "convolution2d_3", "nb_row": 3, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "nb_filter": 64, "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "nb_row": 3, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "input_dim": 189696, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "bias": true, "name": "dense_1", "activity_regularizer": null, "trainable": true, "output_dim": 512, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "input_dim": 512, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "bias": true, "name": "dense_2", "activity_regularizer": null, "trainable": true, "output_dim": 1, "activation": "linear"}}], "keras_version": "1.2.0"}