{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>+\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "function_type": "lambda", "input_dtype": "float32", "trainable": true, "arguments": {}, "output_shape_type": "raw", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "trainable": true, "init": "he_normal", "subsample": [2, 2], "W_constraint": null, "nb_row": 5, "b_constraint": null, "nb_col": 5, "activation": "linear", "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "nb_filter": 24}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": true, "init": "he_normal", "subsample": [2, 2], "W_constraint": null, "nb_row": 5, "b_constraint": null, "nb_col": 5, "activation": "linear", "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "nb_filter": 36}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "trainable": true, "init": "he_normal", "subsample": [2, 2], "W_constraint": null, "nb_row": 5, "b_constraint": null, "nb_col": 5, "activation": "linear", "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "nb_filter": 48}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "trainable": true, "init": "he_normal", "subsample": [1, 1], "W_constraint": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "activation": "linear", "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "nb_filter": 64}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "trainable": true, "init": "he_normal", "subsample": [1, 1], "W_constraint": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "activation": "linear", "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "nb_filter": 64}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "init": "he_normal", "input_dim": 1152, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 1164}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "init": "he_normal", "input_dim": 1164, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 100}}, {"class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "init": "he_normal", "input_dim": 100, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 100}}, {"class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.4, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "init": "he_normal", "input_dim": 100, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 10}}, {"class_name": "ELU", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_5", "init": "he_normal", "input_dim": 10, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 1}}]}