{"keras_version": "1.1.2", "config": [{"config": {"arguments": {}, "name": "lambda_1", "batch_input_shape": [null, 66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>+\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "input_dtype": "float32", "trainable": true, "output_shape": null, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"bias": true, "name": "convolution2d_1", "nb_row": 5, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "init": "he_normal", "W_constraint": null, "nb_filter": 24, "border_mode": "valid", "subsample": [2, 2], "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias": true, "name": "convolution2d_2", "nb_row": 5, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "init": "he_normal", "W_constraint": null, "nb_filter": 36, "border_mode": "valid", "subsample": [2, 2], "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias": true, "name": "convolution2d_3", "nb_row": 5, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "init": "he_normal", "W_constraint": null, "nb_filter": 48, "border_mode": "valid", "subsample": [2, 2], "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias": true, "name": "convolution2d_4", "nb_row": 3, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "nb_filter": 64, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias": true, "name": "convolution2d_5", "nb_row": 3, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "nb_filter": 64, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "name": "dense_1", "activation": "linear", "activity_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "W_constraint": null, "input_dim": null, "output_dim": 1164, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias": true, "name": "dense_2", "activation": "linear", "activity_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "W_constraint": null, "input_dim": null, "output_dim": 100, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias": true, "name": "dense_3", "activation": "linear", "activity_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "W_constraint": null, "input_dim": null, "output_dim": 100, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.4}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "dense_4", "activation": "linear", "activity_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "W_constraint": null, "input_dim": null, "output_dim": 10, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias": true, "name": "dense_5", "activation": "linear", "activity_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "W_constraint": null, "input_dim": null, "output_dim": 1, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}