{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 200, 66, 3], "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>+\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "name": "lambda_1", "output_shape_type": "raw", "function_type": "lambda", "output_shape": null, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "nb_row": 5, "border_mode": "valid", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "name": "convolution2d_1", "nb_col": 5, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "nb_row": 5, "border_mode": "valid", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "name": "convolution2d_2", "nb_col": 5, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "nb_row": 5, "border_mode": "valid", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "name": "convolution2d_3", "nb_col": 5, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "bias": true, "subsample": [1, 1], "dim_ordering": "tf", "name": "convolution2d_4", "nb_col": 3, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "bias": true, "subsample": [1, 1], "dim_ordering": "tf", "name": "convolution2d_5", "nb_col": 3, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "trainable": true, "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": 1152, "W_regularizer": null, "name": "dense_1", "bias": true, "activation": "linear", "output_dim": 1164}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "trainable": true, "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": 1164, "W_regularizer": null, "name": "dense_2", "bias": true, "activation": "linear", "output_dim": 100}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "trainable": true, "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": 100, "W_regularizer": null, "name": "dense_3", "bias": true, "activation": "linear", "output_dim": 100}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "trainable": true, "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": 100, "W_regularizer": null, "name": "dense_4", "bias": true, "activation": "linear", "output_dim": 10}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_9"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "trainable": true, "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": 10, "W_regularizer": null, "name": "dense_5", "bias": true, "activation": "linear", "output_dim": 1}}], "keras_version": "1.2.0"}