{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "bias": true, "input_dtype": "float32", "activation": "elu", "batch_input_shape": [null, 100, 100, 3], "dim_ordering": "tf", "init": "glorot_uniform", "trainable": true, "name": "convolution2d_1", "subsample": [1, 1], "nb_filter": 32, "nb_col": 3, "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "bias": true, "name": "convolution2d_2", "dim_ordering": "tf", "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "activation": "elu", "nb_filter": 32, "nb_col": 3, "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "bias": true, "name": "convolution2d_3", "dim_ordering": "tf", "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "activation": "elu", "nb_filter": 32, "nb_col": 3, "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_3", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "bias": true, "name": "convolution2d_4", "dim_ordering": "tf", "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "activation": "elu", "nb_filter": 64, "nb_col": 3, "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_4", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "bias": true, "name": "convolution2d_5", "dim_ordering": "tf", "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "activation": "elu", "nb_filter": 128, "nb_col": 3, "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_5", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "output_dim": 1024, "bias": true, "name": "dense_1", "input_dim": 128, "init": "glorot_uniform", "trainable": true, "activation": "elu", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "output_dim": 512, "bias": true, "name": "dense_2", "input_dim": 1024, "init": "glorot_uniform", "trainable": true, "activation": "elu", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "output_dim": 256, "bias": true, "name": "dense_3", "input_dim": 512, "init": "glorot_uniform", "trainable": true, "activation": "elu", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "output_dim": 1, "bias": true, "name": "dense_4", "input_dim": 256, "init": "glorot_uniform", "trainable": true, "activation": "linear", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null}}], "keras_version": "1.2.0"}